In [1]:
import pandas as pd

In [2]:
url = 'https://tinyurl.com/titanic-csv'

In [3]:
df = pd.read_csv(url)

In [5]:
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [6]:
df = pd.DataFrame()

In [7]:
df['name'] = ['shotaro ooki','taro yamada']
df['age']  = [21,22]
df['Driver'] = [True, False]

In [8]:
df

           name  age  Driver
0  shotaro ooki   21    True
1   taro yamada   22   False

In [9]:
new_person = pd.Series(['Molly Money',40,True], index=['Name','Age','Driver'])

In [10]:
new_person

Name      Molly Money
Age                40
Driver           True
dtype: object

In [11]:
df.append(new_person, ignore_index=True)

           name   age  Driver   Age         Name
0  shotaro ooki  21.0    True   NaN          NaN
1   taro yamada  22.0   False   NaN          NaN
2           NaN   NaN    True  40.0  Molly Money

In [12]:
df = pd.read_csv(url)

In [13]:
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [14]:
df.shape

(1313, 6)

In [15]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [16]:
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [17]:
df.iloc[1]

Name        Allison, Miss Helen Loraine
PClass                              1st
Age                                   2
Sex                              female
Survived                              0
SexCode                               1
Name: 1, dtype: object

In [18]:
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [19]:
df.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [20]:
df = df.set_index(df['Name'])

In [21]:
df

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
"Zakarian, Mr Artun","Zakarian, Mr Artun",3rd,27.00,male,0,0
"Zakarian, Mr Maprieder","Zakarian, Mr Maprieder",3rd,26.00,male,0,0
"Zenni, Mr Philip","Zenni, Mr Philip",3rd,22.00,male,0,0
"Lievens, Mr Rene","Lievens, Mr Rene",3rd,24.00,male,0,0
"Zimmerman, Leo","Zimmerman, Leo",3rd,29.00,male,0,0

In [24]:
df.iloc[:]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
"Zakarian, Mr Artun","Zakarian, Mr Artun",3rd,27.00,male,0,0
"Zakarian, Mr Maprieder","Zakarian, Mr Maprieder",3rd,26.00,male,0,0
"Zenni, Mr Philip","Zenni, Mr Philip",3rd,22.00,male,0,0
"Lievens, Mr Rene","Lievens, Mr Rene",3rd,24.00,male,0,0
"Zimmerman, Leo","Zimmerman, Leo",3rd,29.00,male,0,0

In [27]:
df[df['Sex'] == 'female'].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [32]:
df[(df['Sex'] == 'female') & (df['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [33]:
df['Sex'].replace("female","Woman").head(2)

Name
Allen, Miss Elisabeth Walton    Woman
Allison, Miss Helen Loraine     Woman
Name: Sex, dtype: object

In [34]:
df['Sex'].replace(["female","male"],["Woman","Man"]).head(5)

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
Name: Sex, dtype: object

In [35]:
df.replace(1,"One").head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29,female,One,One
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2,female,0,One

In [37]:
df.replace(r"1st","First", regex=True).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",First,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",First,2.0,female,0,1

In [39]:
df.rename(columns={'PClass': 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [40]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [41]:
import collections

In [42]:
clm_names =  collections.defaultdict(str)

In [43]:
for name in df.columns:
    clm_names[name]

In [44]:
clm_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [45]:
print('Maximum', df['Age'].max())
print('Maximum', df['Age'].min())
print('Mean', df['Age'].mean())
print('Sum', df['Age'].sum())
print('Count', df['Age'].count())

Maximum 71.0
Maximum 0.17
Mean 30.397989417989415
Sum 22980.88
Count 756

In [46]:
df.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [47]:
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [48]:
df['Sex'].unique

<bound method Series.unique of Name
Allen, Miss Elisabeth Walton                     female
Allison, Miss Helen Loraine                      female
Allison, Mr Hudson Joshua Creighton                male
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    female
Allison, Master Hudson Trevor                      male
                                                  ...
Zakarian, Mr Artun                                 male
Zakarian, Mr Maprieder                             male
Zenni, Mr Philip                                   male
Lievens, Mr Rene                                   male
Zimmerman, Leo                                     male
Name: Sex, Length: 1313, dtype: object>

In [49]:
df['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [50]:
df['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [51]:
df['PClass'].nunique()

4

In [52]:
df[df['Age'].isnull()].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Aubert, Mrs Leontine Pauline","Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
"Barkworth, Mr Algernon H","Barkworth, Mr Algernon H",1st,NaN,male,1,0

In [53]:
import numpy as np

In [54]:
df['Sex'] = df['Sex'].replace('male', np.sum)

In [55]:
df = pd.read_csv(url, na_values=[np.nan, 'None', -999])

In [56]:
df

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [57]:
df.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [58]:
df.drop(['Age','Sex'],axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [59]:
df.drop(df.columns[1],axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

In [60]:
df[df['Sex'] != 'male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [62]:
# df[df['name'] != 'Allison, Miss Helen Loraine'].head(2)

In [63]:
df[df.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [64]:
df.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [65]:
print('元のDataFrame中の行数',len(df))
print("重複削除後の行数:", len(df.drop_duplicates()))

元のDataFrame中の行数 1313
重複削除後の行数: 1313

In [66]:
df.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [67]:
df.drop_duplicates(subset=['Sex'],keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [68]:
df.groupby('Sex').head(2)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [69]:
df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [70]:
df.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [71]:
df.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [72]:
np.random.seed(0)

In [75]:
# time_index = pd.date_range('06/06/2017', periods=100000)

In [76]:
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [77]:
[name.upper() for name in df['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [78]:
def uppercase(x):
    return x.upper()

In [79]:
df['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [80]:
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [81]:
data_a = {'id':['1','2','3'], 'first':['Alex','Amy','Allen'],'last':['Anderson','Ackerman','Ali']}
df_a = pd.DataFrame(data_a, columns=['id','first','last'])
data_b = {'id':['4','5','6'], 'first':['Billy','Brian','Bran'],'last':['Bonder','Black','Balwner']}
df_b = pd.DataFrame(data_b, columns=['id','first','last'])

In [86]:
pd.concat([df_a, df_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [87]:
pd.concat([df_a,df_b],axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [88]:
row = pd.Series([10,'Chris','Chillon'], index=['id','first','id'])

In [90]:
# df_a.append(row, ignore_index=True)

In [91]:
employee_data = {'employee_id':['1','2','3','4'],'name':['Amy Jones', 'Allen','Allien Bees','Tim Horton']}
df_employees = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

In [92]:
sales_data = {'employee_id':['3','4','5','6'],'total_sales':[23456, 2512,2345,1455]}
df_employees = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

In [94]:
# pd.merge(df_employees, sales_data, on='employee_id')

In [96]:
# pd.merge(df_employees, sales_data)